# 1. Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$


# from math import pi
# print (format (pi,'.3f'))


# ------------------------------------------------------------------------------------------------------------------------------------------------------
# ------------------------------------------------------------------------------------------------------------------------------------------------------

# 2. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.


# n = int(input('input a number: '))

# def mul(n):
#     output = list()
#     x = 3
#     while x <= n:
#         if n % x == 0:
#             output.append(x)
#             n = n / x
#         else:
#             x += 1
#     return output

# print(mul(n))  

# ------------------------------------------------------------------------------------------------------------------------------------------------------
# ------------------------------------------------------------------------------------------------------------------------------------------------------


# 3. Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.


# list = [12, 5, 13, 8, 9, 2, 13, 9, 3, 8, 2, 11]
# new_List = []

# for i in list:
#     if list.count(i) == 1:
#         new_List.append(i)
# print(new_List)       

# ------------------------------------------------------------------------------------------------------------------------------------------------------
# ------------------------------------------------------------------------------------------------------------------------------------------------------

# 4. Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и записать в файл многочлен степени k.
# Пример:
# - k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0

# ВОТ ЭТУ ЗАДАЧУ Я НЕ СДЕЛАЛ. ДАЖЕ ПОСЛЕ ПРОСМОТРА НЕ ОСОБО ПОНЯЛ. НАДО БУДЕТ МНЕ ОТДЕЛЬНО В НЕЁ ВНИКНУТЬ, КОГДА ВРЕМЯ БУДЕТ.


# from random import randint

# k = int(input('Enter the natural degree: '))

# coeff = list()
# for i in range(1, k + 2):
#     coeff.append(randint(1, 100))

# l = list()
# for i in range(len(coeff)):
#     if k == 1:
#         l.append(f'{coeff[i]}*x')
#     elif k == 0:
#         l.append(f'{coeff[i]}')
#     else:
#         l.append(f'{coeff[i]}*x**{k}')
#     sym = randit(0, 1)
#     if sym == 1:
#         l.append('+')
#     elif sym == 0:
#         l.append('-')
#     k -= 1

# l.pop(-1)
# l.append('=0')
# file = open('output.txt', 'w')
# file.write(''.join(l))
# file.close()





# ------------------------------------------------------------------------------------------------------------------------------------------------------
# ------------------------------------------------------------------------------------------------------------------------------------------------------

# 5. Даны два файла, в каждом из которых находится запись многочлена. Задача - сформировать файл, содержащий сумму многочленов.

# ЭТУ ТОЖЕ НЕ СМОТРИТЕ. В ОБЩЕМ, ДАЖЕ ТРОЙКА БУДЕТ ПОХВАЛОЙ :)


# numerous1 = '3 * (x**4) - 5 * x + 7 * (x**2)'
# numerous2 = '7 + (x**3) - 3 * x '

# data = open('num1.txt', 'w')
# data.write(num1)
# data.close()

# data = open('num2.txt', 'w')
# data.write(num2)
# data.close()


# data = open('sum.txt', 'w')
# data.write(sum)
# data.close()
































































